{
    "title": "JAMID Whitepaper",
    "sections": [
        {
            "id": "introduction",
            "number": "1",
            "title": "Introduction",
            "content": "JAMID is a smart contract built with ink! that defines a new trustless identity layer for the Polkadot JAM ecosystem. It introduces a public, on-chain registry for JAM Identities (JIDs) — unique, human-readable identifiers secured by cryptography, interoperable across parachains, and governed collectively by the community.\n\nThe project was initiated by Snowinch S.L. and proposed as a public good under the Polkadot Treasury to ensure that identity remains an open, verifiable, and self-sovereign component of the JAM network."
        },
        {
            "id": "motivation",
            "number": "2",
            "title": "Motivation",
            "content": "Today, most blockchain identities depend on centralized or semi-custodial systems — often controlled by single entities, DAOs, or external APIs. This introduces friction, trust dependencies, and governance risks that conflict with the ethos of Polkadot's decentralized coordination model.\n\nJAMID addresses this by:",
            "list": [
                "Eliminating custodians and intermediaries.",
                "Verifying ownership cryptographically, not administratively.",
                "Redirecting all economic flows to the Polkadot Treasury, not a private company.",
                "Enabling cross-chain identity resolution between JAM and parachains."
            ],
            "footer": "The result is an identity layer owned by the network itself, not by any organization."
        },
        {
            "id": "design",
            "number": "3",
            "title": "Design Overview",
            "content": "JAMID is structured as a modular identity registry, with the following key features:",
            "list": [
                "JID Registration — Users can register a JAM Identity (JID) tied to their on-chain account.",
                "Resolution — Any user or parachain can resolve a JID to the corresponding public key or metadata.",
                "Reverse Lookup — Map an account back to its JID for cross-service identification.",
                "Metadata Layer — Attach optional encrypted or external metadata (e.g., IPFS pointer).",
                "Governance Hooks — Designed to integrate with Polkadot's OpenGov for DAO-based parameter control."
            ],
            "footer": "All JIDs are unique, non-transferable (by default), and secured through sr25519 or ed25519 signature proofs."
        },
        {
            "id": "architecture",
            "number": "4",
            "title": "Architecture",
            "content": "The JAMID smart contract operates as a JAM-compatible identity oracle, interacting directly with other modules and parachains via JAM's message-passing system.\n\nCore architectural traits:",
            "list": [
                "ink! Runtime Compatibility — Deployed via cargo-contract, supporting standard Polkadot accounts.",
                "Stateless Verification — Ownership proofs validated by on-chain cryptographic checks.",
                "DAO-ready Structure — Admin functions are temporary and will be burned post-DAO integration.",
                "Cross-Chain Resolution — Designed to interface with JAM messaging primitives and XCM protocols."
            ]
        },
        {
            "id": "security",
            "number": "5",
            "title": "Security & Trustlessness",
            "content": "At launch, JAMID includes temporary admin controls (for testing and treasury migration). Once the system reaches maturity, these controls will be irreversibly burned, ensuring:",
            "list": [
                "No single entity can alter records or change fees.",
                "Fee ownership is fully transferred to the Treasury.",
                "Governance changes require OpenGov referenda."
            ],
            "footer": "The final goal is a fully autonomous identity layer — cryptographically secure, economically neutral, and socially governed."
        },
        {
            "id": "governance",
            "number": "6",
            "title": "Governance & Treasury",
            "content": "All fees generated by JAMID (e.g., identity registration costs) are automatically redirected to the Polkadot Treasury. This ensures the protocol contributes directly to the funding of the ecosystem.\n\nFuture governance proposals will:",
            "list": [
                "Define DAO-controlled parameters (fees, metadata limits, expiration logic).",
                "Allow verified contributors to maintain or extend the system.",
                "Ensure that upgrades follow transparent OpenGov referenda."
            ]
        },
        {
            "id": "specs",
            "number": "7",
            "title": "Technical Specifications",
            "specs": [
                {
                    "label": "Language",
                    "value": "Rust (ink!)"
                },
                {
                    "label": "Signature Schemes",
                    "value": "sr25519 / ed25519"
                },
                {
                    "label": "Deployment Target",
                    "value": "Polkadot JAM testnet → mainnet"
                },
                {
                    "label": "Ownership",
                    "value": "Temporary admin key (burned at v2.0)"
                },
                {
                    "label": "Fee Destination",
                    "value": "Polkadot Treasury"
                },
                {
                    "label": "Data Storage",
                    "value": "On-chain key-value with optional IPFS metadata"
                },
                {
                    "label": "Immutability",
                    "value": "Guaranteed post-DAO transition"
                }
            ]
        },
        {
            "id": "roadmap",
            "number": "8",
            "title": "Roadmap",
            "table": [
                {
                    "phase": "v0.9",
                    "description": "Internal testing (Snowinch)"
                },
                {
                    "phase": "v1.0",
                    "description": "Public deployment on JAM testnet"
                },
                {
                    "phase": "v1.1",
                    "description": "DAO recognition & Treasury redirection"
                },
                {
                    "phase": "v2.0",
                    "description": "Burned ownership → full autonomy"
                }
            ]
        },
        {
            "id": "acknowledgments",
            "number": "9",
            "title": "Acknowledgments",
            "content": "JAMID is developed and maintained by Snowinch S.L., a contributor to the Polkadot OpenGov ecosystem. We thank the JAM engineering community, ink! maintainers, and OpenGov contributors for their continuous feedback and technical guidance."
        },
        {
            "id": "disclaimer",
            "number": "10",
            "title": "Disclaimer",
            "content": "JAMID is currently in testing phase (v0.9). Admin controls and signature verification are simplified and not yet trustless. The current version should not be used for production identity storage. Full immutability and DAO integration will be implemented in version v2.0.",
            "type": "warning"
        }
    ]
}